---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.FamilyStructuralMaterialTypeFilter
source: html/e457fc9b-7de8-ddb3-1550-f94f82cdb807.htm
---
# FamilyStructuralMaterialTypeFilter Members

Constructs a new instance of a filter to match families that have the given structural material type.